RubenKelevra/espressif_esp32-camera/target/esp32s3/ll_cam.c
// Copyright 2010-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include <string.h>
#include "soc/system_reg.h"
#include "soc/lcd_cam_struct.h"
#include "soc/lcd_cam_reg.h"
#include "soc/gdma_struct.h"
#include "soc/gdma_reg.h"
#include "hal/clk_gate_ll.h"
#include "esp_private/gdma.h"
#include "ll_cam.h"
#include "cam_hal.h"
#include "esp_rom_gpio.h"

#if (ESP_IDF_VERSION_MAJOR >= 5)
#include "driver/gpio.h"
#include "soc/gpio_sig_map.h"
#include "soc/gpio_periph.h"
#include "soc/io_mux_reg.h"
#define gpio_matrix_in(a,b,c) esp_rom_gpio_connect_in_signal(a,b,c)
#define gpio_matrix_out(a,b,c,d) esp_rom_gpio_connect_out_signal(a,b,c,d)
#define ets_delay_us(a) esp_rom_delay_us(a)
#endif

#if (ESP_IDF_VERSION_MAJOR > 5)
#include "soc/dport_access.h"
#else
#include "soc/gdma_periph.h"
#endif

#if !defined(SOC_GDMA_PAIRS_PER_GROUP) && defined(SOC_GDMA_PAIRS_PER_GROUP_MAX)
#define SOC_GDMA_PAIRS_PER_GROUP SOC_GDMA_PAIRS_PER_GROUP_MAX
#endif

static const char *TAG = "s3 ll_cam";

void ll_cam_dma_print_state(cam_obj_t *cam)
{
    esp_rom_printf("dma_infifo_status[%u]  :\n", cam->dma_num);
    esp_rom_printf("  infifo_full_l1       : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_full_l1);
    esp_rom_printf("  infifo_empty_l1      : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_empty_l1);
    esp_rom_printf("  infifo_full_l2       : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_full_l2);
    esp_rom_printf("  infifo_empty_l2      : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_empty_l2);
    esp_rom_printf("  infifo_full_l3       : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_full_l3);
    esp_rom_printf("  infifo_empty_l3      : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_empty_l3);
    esp_rom_printf("  infifo_cnt_l1        : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_cnt_l1);
    esp_rom_printf("  infifo_cnt_l2        : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_cnt_l2);
    esp_rom_printf("  infifo_cnt_l3        : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.infifo_cnt_l3);
    esp_rom_printf("  in_remain_under_1b_l3: %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.in_remain_under_1b_l3);
    esp_rom_printf("  in_remain_under_2b_l3: %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.in_remain_under_2b_l3);
    esp_rom_printf("  in_remain_under_3b_l3: %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.in_remain_under_3b_l3);
    esp_rom_printf("  in_remain_under_4b_l3: %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.in_remain_under_4b_l3);
    esp_rom_printf("  in_buf_hungry        : %lu\n", GDMA.channel[cam->dma_num].in.infifo_status.in_buf_hungry);
    esp_rom_printf("dma_state[%u]          :\n", cam->dma_num);
    esp_rom_printf("  dscr_addr            : 0x%lx\n", GDMA.channel[cam->dma_num].in.state.dscr_addr);
    esp_rom_printf("  in_dscr_state        : %lu\n", GDMA.channel[cam->dma_num].in.state.in_dscr_state);
    esp_rom_printf("  in_state             : %lu\n", GDMA.channel[cam->dma_num].in.state.in_state);
}


void ll_cam_dma_print_timeout_state(cam_obj_t *cam)
{
    esp_rom_printf("cam_timeout_state[%u]: raw=0x%lx st=0x%lx ena=0x%lx clr=0x%lx start=%lu stop_en=%lu vs_eof=%lu link_start=%lu link_stop=%lu link_restart=%lu\n",
                   cam->dma_num,
                   GDMA.channel[cam->dma_num].in.int_raw.val,
                   GDMA.channel[cam->dma_num].in.int_st.val,
                   GDMA.channel[cam->dma_num].in.int_ena.val,
                   GDMA.channel[cam->dma_num].in.int_clr.val,
                   LCD_CAM.cam_ctrl1.cam_start,
                   LCD_CAM.cam_ctrl.cam_stop_en,
                   LCD_CAM.cam_ctrl.cam_vs_eof_en,
                   GDMA.channel[cam->dma_num].in.link.start,
                   GDMA.channel[cam->dma_num].in.link.stop,
                   GDMA.channel[cam->dma_num].in.link.restart);
    esp_rom_printf("cam_timeout_fifo[%u]: full_l1=%lu cnt_l1=%lu full_l2=%lu cnt_l2=%lu full_l3=%lu cnt_l3=%lu empty_l1=%lu empty_l2=%lu empty_l3=%lu\n",
                   cam->dma_num,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_full_l1,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_cnt_l1,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_full_l2,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_cnt_l2,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_full_l3,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_cnt_l3,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_empty_l1,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_empty_l2,
                   GDMA.channel[cam->dma_num].in.infifo_status.infifo_empty_l3);
    esp_rom_printf("cam_timeout_dma[%u]: dscr=0x%lx dscr_state=%lu in_state=%lu infifo_thrs=%lu\n",
                   cam->dma_num,
                   GDMA.channel[cam->dma_num].in.state.dscr_addr,
                   GDMA.channel[cam->dma_num].in.state.in_dscr_state,
                   GDMA.channel[cam->dma_num].in.state.in_state,
                   GDMA.channel[cam->dma_num].in.conf1.dma_infifo_full_thrs);
}

void ll_cam_dma_reset(cam_obj_t *cam)
{
    /* gdma_config_transfer() configures descriptor burst, data burst, and the
     * external-memory burst block size.  A raw conf0.val = 0 here wipes those
     * transport settings, which is especially harmful for direct PSRAM DMA.
     * Preserve the transfer configuration while still resetting the RX engine. */
    uint32_t desc_burst_en = GDMA.channel[cam->dma_num].in.conf0.indscr_burst_en;
    uint32_t data_burst_en = GDMA.channel[cam->dma_num].in.conf0.in_data_burst_en;
    uint32_t ext_mem_bk_size = GDMA.channel[cam->dma_num].in.conf1.in_ext_mem_bk_size;

    GDMA.channel[cam->dma_num].in.int_clr.val = ~0;
    GDMA.channel[cam->dma_num].in.int_ena.val = 0;

