RubenKelevra/espressif_esp32-camera/target/esp32s3/ll_cam.c
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 1;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 0;

    GDMA.channel[cam->dma_num].in.conf0.indscr_burst_en = desc_burst_en;
    GDMA.channel[cam->dma_num].in.conf0.in_data_burst_en = data_burst_en;
    GDMA.channel[cam->dma_num].in.conf1.in_ext_mem_bk_size = ext_mem_bk_size;
    GDMA.channel[cam->dma_num].in.conf1.in_check_owner = 1;
    //GDMA.channel[cam->dma_num].in.pri.rx_pri = 1;//rx prio 0-15
    //GDMA.channel[cam->dma_num].in.sram_size.in_size = 6;//This register is used to configure the size of L2 Tx FIFO for Rx channel. 0:16 bytes, 1:24 bytes, 2:32 bytes, 3: 40 bytes, 4: 48 bytes, 5:56 bytes, 6: 64 bytes, 7: 72 bytes, 8: 80 bytes.
    //GDMA.channel[cam->dma_num].in.weight.rx_weight = 7;//The weight of Rx channel 0-15
}

static void CAMERA_ISR_IRAM_ATTR ll_cam_vsync_isr(void *arg)
{
    //DBG_PIN_SET(1);
    cam_obj_t *cam = (cam_obj_t *)arg;
    BaseType_t HPTaskAwoken = pdFALSE;

    typeof(LCD_CAM.lc_dma_int_st) status = LCD_CAM.lc_dma_int_st;
    if (status.val == 0) {
        return;
    }

    LCD_CAM.lc_dma_int_clr.val = status.val;

    if (status.cam_vsync_int_st) {
        /* In VSYNC-EOF DMA mode, VSYNC is both the camera frame boundary and
         * the hardware source for GDMA EOF.  The ISR must not stop or clear
         * GDMA here; descriptor writeback is consumed by the GDMA EOF path. */
        ll_cam_send_event(cam, CAM_VSYNC_EVENT, &HPTaskAwoken);
    }

    if (HPTaskAwoken == pdTRUE) {
        portYIELD_FROM_ISR();
    }
    //DBG_PIN_SET(0);
}

static void CAMERA_ISR_IRAM_ATTR ll_cam_dma_isr(void *arg)
{
    cam_obj_t *cam = (cam_obj_t *)arg;
    BaseType_t HPTaskAwoken = pdFALSE;

    typeof(GDMA.channel[cam->dma_num].in.int_st) status = GDMA.channel[cam->dma_num].in.int_st;
    if (status.val == 0) {
        return;
    }

    GDMA.channel[cam->dma_num].in.int_clr.val = status.val;

    if (status.infifo_full_wm) {
        /* Latch this as a diagnostic/recovery event, but do not leave the
         * watermark interrupt enabled.  When the camera path is backpressured
         * this condition can immediately reassert and storm the shared ISR. */
        GDMA.channel[cam->dma_num].in.int_ena.infifo_full_wm = 0;
        ll_cam_send_event(cam, CAM_DMA_FIFO_FULL_EVENT, &HPTaskAwoken);
    }
    if (status.in_dscr_err || status.in_dscr_empty) {
        ll_cam_send_event(cam, CAM_DMA_ERROR_EVENT, &HPTaskAwoken);
    }
    if (status.in_suc_eof) {
        ll_cam_send_event(cam, CAM_IN_SUC_EOF_EVENT, &HPTaskAwoken);
    }

    if (HPTaskAwoken == pdTRUE) {
        portYIELD_FROM_ISR();
    }
}

bool IRAM_ATTR ll_cam_stop(cam_obj_t *cam)
{
    GDMA.channel[cam->dma_num].in.int_ena.in_suc_eof = 0;
    GDMA.channel[cam->dma_num].in.int_ena.in_dscr_err = 0;
    GDMA.channel[cam->dma_num].in.int_ena.in_dscr_empty = 0;
    GDMA.channel[cam->dma_num].in.int_ena.infifo_full_wm = 0;
    GDMA.channel[cam->dma_num].in.int_clr.in_suc_eof = 1;
    GDMA.channel[cam->dma_num].in.int_clr.in_dscr_err = 1;
    GDMA.channel[cam->dma_num].in.int_clr.in_dscr_empty = 1;
    GDMA.channel[cam->dma_num].in.int_clr.dma_infifo_full_wm = 1;
    LCD_CAM.cam_ctrl1.cam_start = 0;
    LCD_CAM.cam_ctrl.cam_stop_en = 0;
    GDMA.channel[cam->dma_num].in.link.stop = 1;
    return true;
}

static void IRAM_ATTR ll_cam_reset_dma_descriptors(lldesc_t *dma, uint32_t count)
{
    for (uint32_t i = 0; i < count; i++) {
        dma[i].length = 0;
        dma[i].sosf = 0;
        dma[i].eof = 0;
        dma[i].owner = 1;
    }
}

bool ll_cam_start(cam_obj_t *cam, int frame_pos)
{
    LCD_CAM.cam_ctrl1.cam_start = 0;

    GDMA.channel[cam->dma_num].in.int_clr.in_suc_eof = 1;
    GDMA.channel[cam->dma_num].in.int_clr.in_dscr_err = 1;
    GDMA.channel[cam->dma_num].in.int_clr.in_dscr_empty = 1;
    GDMA.channel[cam->dma_num].in.int_clr.dma_infifo_full_wm = 1;
    GDMA.channel[cam->dma_num].in.int_ena.in_suc_eof = 1;
    if (cam->jpeg_mode && cam->dma_mode) {
        /* TRM reset value is 0x0c. Enable this interrupt with CAM_STOP_EN to
         * observe and recover from GDMA RX FIFO pressure instead of waiting
         * forever for a VSYNC EOF that cannot arrive after the camera stops. */
        GDMA.channel[cam->dma_num].in.conf1.dma_infifo_full_thrs = 0x0c;
        GDMA.channel[cam->dma_num].in.int_ena.in_dscr_err = 1;
        GDMA.channel[cam->dma_num].in.int_ena.in_dscr_empty = 1;
        GDMA.channel[cam->dma_num].in.int_ena.infifo_full_wm = 1;
    } else {
        GDMA.channel[cam->dma_num].in.int_ena.in_dscr_err = 0;
        GDMA.channel[cam->dma_num].in.int_ena.in_dscr_empty = 0;
        GDMA.channel[cam->dma_num].in.int_ena.infifo_full_wm = 0;
    }

    LCD_CAM.cam_ctrl1.cam_reset = 1;
    LCD_CAM.cam_ctrl1.cam_reset = 0;
    LCD_CAM.cam_ctrl1.cam_afifo_reset = 1;
    LCD_CAM.cam_ctrl1.cam_afifo_reset = 0;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 1;
    GDMA.channel[cam->dma_num].in.conf0.in_rst = 0;

    if (cam->jpeg_mode && cam->dma_mode) {
        LCD_CAM.cam_ctrl.cam_stop_en = 1;
        /* Keep VSYNC EOF disabled while cam_start_frame() emits the synthetic
         * VSYNC priming pulse.  The pulse is needed to arm the LCD_CAM capture
         * path, but it must not complete the just-started GDMA transaction. */
        LCD_CAM.cam_ctrl.cam_vs_eof_en = 0;
        LCD_CAM.cam_ctrl1.cam_rec_data_bytelen = cam->dma_buffer_size - 1;
    } else {
        LCD_CAM.cam_ctrl.cam_vs_eof_en = 0;
        LCD_CAM.cam_ctrl1.cam_rec_data_bytelen = cam->dma_half_buffer_size - 1; // Ping pong operation
    }

    if (!cam->dma_mode) {
        ll_cam_reset_dma_descriptors(cam->dma, cam->dma_node_cnt);
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->dma[0]) & 0xfffff;
    } else {
        ll_cam_reset_dma_descriptors(cam->frames[frame_pos].dma, cam->dma_node_cnt);
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->frames[frame_pos].dma[0]) & 0xfffff;
    }

    GDMA.channel[cam->dma_num].in.link.start = 1;

    LCD_CAM.cam_ctrl.cam_update = 1;
    LCD_CAM.cam_ctrl1.cam_start = 1;
    return true;
}

esp_err_t ll_cam_deinit(cam_obj_t *cam)
{
    if (cam->cam_intr_handle) {
        esp_intr_free(cam->cam_intr_handle);
        cam->cam_intr_handle = NULL;
    }

